//
//  Data.swift
//  japanbaseball
//
//  Created by 松尾健司 on 2023/03/25.
//

import SwiftUI

struct NewsData {
    var image = ["news0","news1","news2","news3","news4"]
    var title = ["プロ野球 オープン戦4試合の結果（8日）","WBC日本 1次ラウンドから全勝優勝【詳しく】MVPは大谷翔平","WBC 大谷翔平 “泥だらけのストッパー” SNSでトレンド","海星 長崎日大高 指導した2校がそろって高校野球 センバツ出場","父の蒸発、まさかのプロ入り、新人記録を作るも26歳で戦力外…『プロ野球ニュース』初代キャスター・佐々木信也の知られざる過去"]
    let newsText1 = "プロ野球のオープン戦は4試合が行われました。\n\nソフトバンク 8-8 \nヤクルト ソフトバンク対ヤクルトは8対8で引き分けました。\nソフトバンクは調整が遅れていた42歳の和田投手がオープン戦初登板で2回を無失点と好投\n上林選手が2試合連続のホームランを打ちました。\nヤクルトは先発した43歳の石川投手が3回を投げ2失点。\n打線ではベテランの青木選手が満塁の場面で2点タイムリーを打ち、好調ぶりを示しました。\n\n楽天 5-4\nDeNA楽天対DeNAは楽天が5対4で勝ちました。\n楽天は3年目の早川投手が3回をノーヒット、無失点で抑え、先発ローテーション入りをアピールしました。\n先発した岸投手も4回を1失点にまとめました。\nDeNA先発の上茶谷投手は4回を投げ、ホームラン1本を含む4失点と粘りを欠きました。"
    var text = ["プロ野球のオープン戦は4試合が行われました。\n\nソフトバンク 8-8 \nヤクルト ソフトバンク対ヤクルトは8対8で引き分けました。\nソフトバンクは調整が遅れていた42歳の和田投手がオープン戦初登板で2回を無失点と好投\n上林選手が2試合連続のホームランを打ちました。\nヤクルトは先発した43歳の石川投手が3回を投げ2失点。\n打線ではベテランの青木選手が満塁の場面で2点タイムリーを打ち、好調ぶりを示しました。\n\n楽天 5-4\nDeNA楽天対DeNAは楽天が5対4で勝ちました。\n楽天は3年目の早川投手が3回をノーヒット、無失点で抑え、先発ローテーション入りをアピールしました。\n先発した岸投手も4回を1失点にまとめました。\nDeNA先発の上茶谷投手は4回を投げ、ホームラン1本を含む4失点と粘りを欠きました。","","野球のWBC＝ワールド・ベースボール・クラシック。日本がアメリカに勝って3大会ぶり3回目の優勝を果たしました。9回、抑えとして登板した大谷翔平選手について、SNS上ではグラウンドの土で汚れていたユニフォーム姿が「泥だらけのストッパー」などと表現され、トレンドに入りました。\nアメリカのマイアミで行われたWBCの決勝で、日本は1点リードの9回、この試合で3番・指名打者で出場していた大谷選手が抑えとしてマウンドに上がりました。抑えを意味する「ストッパー」の言葉を組み合わせた「泥だらけのストッパー」というワードがツイッターのトレンドに入りました。\n\nSNS上では…。\n\n「泥だらけのストッパー！！大谷翔平！！一番野球を楽しんで、野球の素晴らしさを伝えてるプレイヤー野球少年、野球少女たちは目が離せない回だ！！！」\n「ユニフォームが泥だらけのストッパーも初めて見たけど、良かった…最高すぎた\nなどといった投稿が相次ぎました。\n大谷選手は9回を0点に抑え優勝投手となりました。“大谷MVP”もトレンドにまた大谷選手は、今大会のMVP＝最優秀選手にも選ばれました。\n\nピッチャーとして2勝を挙げたほか、バッターとしても1次ラウンドのオーストラリア戦で、スリーランホームランを打つなど打線を引っ張っていました。\n\nこれを受けて「大谷MVP」もツイッターのトレンドに入り「この瞬間を共にできて幸せ大谷MVPおめでとう侍JAPANおめでとうーー！！」とか「大谷MVP！！！このグラブと帽子投げる勢いカッコよすぎる明日真似します！」といった投稿が相次ぎました。","工事中","工事中"]
   
}
